k6/results/grpc/orders-benchmark.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scripts/benchmark/orders-post.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/10 VUs  0m01.0s/4m00.0s

running (0m02.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m02.0s/4m00.0s

running (0m03.0s), 01/10 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m03.0s/4m00.0s

running (0m04.0s), 02/10 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m04.0s/4m00.0s

running (0m05.0s), 02/10 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m05.0s/4m00.0s

running (0m06.0s), 02/10 VUs, 7 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m06.0s/4m00.0s

running (0m07.0s), 03/10 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 03/10 VUs  0m07.0s/4m00.0s

running (0m08.0s), 03/10 VUs, 12 complete and 0 interrupted iterations
default   [   3% ] 03/10 VUs  0m08.0s/4m00.0s

running (0m09.0s), 03/10 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 03/10 VUs  0m09.0s/4m00.0s

running (0m10.0s), 03/10 VUs, 18 complete and 0 interrupted iterations
default   [   4% ] 03/10 VUs  0m10.0s/4m00.0s

running (0m11.0s), 04/10 VUs, 21 complete and 0 interrupted iterations
default   [   5% ] 04/10 VUs  0m11.0s/4m00.0s

running (0m12.0s), 04/10 VUs, 25 complete and 0 interrupted iterations
default   [   5% ] 04/10 VUs  0m12.0s/4m00.0s

running (0m13.0s), 04/10 VUs, 29 complete and 0 interrupted iterations
default   [   5% ] 04/10 VUs  0m13.0s/4m00.0s

running (0m14.0s), 05/10 VUs, 33 complete and 0 interrupted iterations
default   [   6% ] 05/10 VUs  0m14.0s/4m00.0s

running (0m15.0s), 05/10 VUs, 38 complete and 0 interrupted iterations
default   [   6% ] 05/10 VUs  0m15.0s/4m00.0s

running (0m16.0s), 05/10 VUs, 43 complete and 0 interrupted iterations
default   [   7% ] 05/10 VUs  0m16.0s/4m00.0s

running (0m17.0s), 06/10 VUs, 48 complete and 0 interrupted iterations
default   [   7% ] 06/10 VUs  0m17.0s/4m00.0s

running (0m18.0s), 06/10 VUs, 54 complete and 0 interrupted iterations
default   [   7% ] 06/10 VUs  0m18.0s/4m00.0s

running (0m19.0s), 06/10 VUs, 60 complete and 0 interrupted iterations
default   [   8% ] 06/10 VUs  0m19.0s/4m00.0s

running (0m20.0s), 06/10 VUs, 66 complete and 0 interrupted iterations
default   [   8% ] 06/10 VUs  0m20.0s/4m00.0s

running (0m21.0s), 07/10 VUs, 72 complete and 0 interrupted iterations
default   [   9% ] 07/10 VUs  0m21.0s/4m00.0s

running (0m22.0s), 07/10 VUs, 79 complete and 0 interrupted iterations
default   [   9% ] 07/10 VUs  0m22.0s/4m00.0s

running (0m23.0s), 07/10 VUs, 86 complete and 0 interrupted iterations
default   [  10% ] 07/10 VUs  0m23.0s/4m00.0s

running (0m24.0s), 08/10 VUs, 93 complete and 0 interrupted iterations
default   [  10% ] 08/10 VUs  0m24.0s/4m00.0s

running (0m25.0s), 08/10 VUs, 101 complete and 0 interrupted iterations
default   [  10% ] 08/10 VUs  0m25.0s/4m00.0s

running (0m26.0s), 08/10 VUs, 109 complete and 0 interrupted iterations
default   [  11% ] 08/10 VUs  0m26.0s/4m00.0s

running (0m27.0s), 09/10 VUs, 117 complete and 0 interrupted iterations
default   [  11% ] 09/10 VUs  0m27.0s/4m00.0s

running (0m28.0s), 09/10 VUs, 126 complete and 0 interrupted iterations
default   [  12% ] 09/10 VUs  0m28.0s/4m00.0s

running (0m29.0s), 09/10 VUs, 135 complete and 0 interrupted iterations
default   [  12% ] 09/10 VUs  0m29.0s/4m00.0s

running (0m30.0s), 09/10 VUs, 144 complete and 0 interrupted iterations
default   [  12% ] 09/10 VUs  0m30.0s/4m00.0s

running (0m31.0s), 10/10 VUs, 153 complete and 0 interrupted iterations
default   [  13% ] 10/10 VUs  0m31.0s/4m00.0s

running (0m32.0s), 10/10 VUs, 163 complete and 0 interrupted iterations
default   [  13% ] 10/10 VUs  0m32.0s/4m00.0s

running (0m33.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
default   [  14% ] 10/10 VUs  0m33.0s/4m00.0s

running (0m34.0s), 10/10 VUs, 183 complete and 0 interrupted iterations
default   [  14% ] 10/10 VUs  0m34.0s/4m00.0s

running (0m35.0s), 10/10 VUs, 193 complete and 0 interrupted iterations
default   [  15% ] 10/10 VUs  0m35.0s/4m00.0s

running (0m36.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
default   [  15% ] 10/10 VUs  0m36.0s/4m00.0s

running (0m37.0s), 10/10 VUs, 213 complete and 0 interrupted iterations
default   [  15% ] 10/10 VUs  0m37.0s/4m00.0s

running (0m38.0s), 10/10 VUs, 223 complete and 0 interrupted iterations
default   [  16% ] 10/10 VUs  0m38.0s/4m00.0s

running (0m39.0s), 10/10 VUs, 233 complete and 0 interrupted iterations
default   [  16% ] 10/10 VUs  0m39.0s/4m00.0s

running (0m40.0s), 10/10 VUs, 243 complete and 0 interrupted iterations
default   [  17% ] 10/10 VUs  0m40.0s/4m00.0s

running (0m41.0s), 10/10 VUs, 253 complete and 0 interrupted iterations
default   [  17% ] 10/10 VUs  0m41.0s/4m00.0s

running (0m42.0s), 10/10 VUs, 263 complete and 0 interrupted iterations
default   [  17% ] 10/10 VUs  0m42.0s/4m00.0s

running (0m43.0s), 10/10 VUs, 273 complete and 0 interrupted iterations
default   [  18% ] 10/10 VUs  0m43.0s/4m00.0s

running (0m44.0s), 10/10 VUs, 283 complete and 0 interrupted iterations
default   [  18% ] 10/10 VUs  0m44.0s/4m00.0s

running (0m45.0s), 10/10 VUs, 293 complete and 0 interrupted iterations
default   [  19% ] 10/10 VUs  0m45.0s/4m00.0s

running (0m46.0s), 10/10 VUs, 303 complete and 0 interrupted iterations
default   [  19% ] 10/10 VUs  0m46.0s/4m00.0s

running (0m47.0s), 10/10 VUs, 313 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  0m47.0s/4m00.0s

running (0m48.0s), 10/10 VUs, 323 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  0m48.0s/4m00.0s

running (0m49.0s), 10/10 VUs, 333 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  0m49.0s/4m00.0s

running (0m50.0s), 10/10 VUs, 343 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  0m50.0s/4m00.0s

running (0m51.0s), 10/10 VUs, 353 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  0m51.0s/4m00.0s

running (0m52.0s), 10/10 VUs, 363 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  0m52.0s/4m00.0s

running (0m53.0s), 10/10 VUs, 373 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  0m53.0s/4m00.0s

running (0m54.0s), 10/10 VUs, 383 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  0m54.0s/4m00.0s

running (0m55.0s), 10/10 VUs, 393 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  0m55.0s/4m00.0s

running (0m56.0s), 10/10 VUs, 403 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  0m56.0s/4m00.0s

running (0m57.0s), 10/10 VUs, 413 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  0m57.0s/4m00.0s

running (0m58.0s), 10/10 VUs, 423 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  0m58.0s/4m00.0s

running (0m59.0s), 10/10 VUs, 433 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  0m59.0s/4m00.0s

running (1m00.0s), 10/10 VUs, 443 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m00.0s/4m00.0s

running (1m01.0s), 10/10 VUs, 453 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m01.0s/4m00.0s

running (1m02.0s), 10/10 VUs, 463 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m02.0s/4m00.0s

running (1m03.0s), 10/10 VUs, 473 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m03.0s/4m00.0s

running (1m04.0s), 10/10 VUs, 483 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m04.0s/4m00.0s

running (1m05.0s), 10/10 VUs, 493 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m05.0s/4m00.0s

running (1m06.0s), 10/10 VUs, 503 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m06.0s/4m00.0s

running (1m07.0s), 10/10 VUs, 513 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m07.0s/4m00.0s

running (1m08.0s), 10/10 VUs, 523 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m08.0s/4m00.0s

running (1m09.0s), 10/10 VUs, 533 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m09.0s/4m00.0s

running (1m10.0s), 10/10 VUs, 543 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m10.0s/4m00.0s

running (1m11.0s), 10/10 VUs, 553 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m11.0s/4m00.0s

running (1m12.0s), 10/10 VUs, 563 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m12.0s/4m00.0s

running (1m13.0s), 10/10 VUs, 573 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m13.0s/4m00.0s

running (1m14.0s), 10/10 VUs, 583 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m14.0s/4m00.0s

running (1m15.0s), 10/10 VUs, 593 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m15.0s/4m00.0s

running (1m16.0s), 10/10 VUs, 603 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m16.0s/4m00.0s

running (1m17.0s), 10/10 VUs, 613 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m17.0s/4m00.0s

running (1m18.0s), 10/10 VUs, 623 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m18.0s/4m00.0s

running (1m19.0s), 10/10 VUs, 633 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m19.0s/4m00.0s

running (1m20.0s), 10/10 VUs, 643 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m20.0s/4m00.0s

running (1m21.0s), 10/10 VUs, 653 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m21.0s/4m00.0s

running (1m22.0s), 10/10 VUs, 663 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m22.0s/4m00.0s

running (1m23.0s), 10/10 VUs, 673 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m23.0s/4m00.0s

running (1m24.0s), 10/10 VUs, 683 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m24.0s/4m00.0s

running (1m25.0s), 10/10 VUs, 693 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m25.0s/4m00.0s

running (1m26.0s), 10/10 VUs, 703 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m26.0s/4m00.0s

running (1m27.0s), 10/10 VUs, 713 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m27.0s/4m00.0s

running (1m28.0s), 10/10 VUs, 723 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m28.0s/4m00.0s

running (1m29.0s), 10/10 VUs, 733 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m29.0s/4m00.0s

running (1m30.0s), 10/10 VUs, 743 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m30.0s/4m00.0s

running (1m31.0s), 10/10 VUs, 753 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m31.0s/4m00.0s

running (1m32.0s), 10/10 VUs, 763 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m32.0s/4m00.0s

running (1m33.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m33.0s/4m00.0s

running (1m34.0s), 10/10 VUs, 783 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m34.0s/4m00.0s

running (1m35.0s), 10/10 VUs, 793 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m35.0s/4m00.0s

running (1m36.0s), 10/10 VUs, 803 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m36.0s/4m00.0s

running (1m37.0s), 10/10 VUs, 813 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m37.0s/4m00.0s

running (1m38.0s), 10/10 VUs, 823 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  1m38.0s/4m00.0s

running (1m39.0s), 10/10 VUs, 833 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  1m39.0s/4m00.0s

running (1m40.0s), 10/10 VUs, 843 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  1m40.0s/4m00.0s

running (1m41.0s), 10/10 VUs, 853 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  1m41.0s/4m00.0s

running (1m42.0s), 10/10 VUs, 863 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  1m42.0s/4m00.0s

running (1m43.0s), 10/10 VUs, 873 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  1m43.0s/4m00.0s

running (1m44.0s), 10/10 VUs, 883 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  1m44.0s/4m00.0s

running (1m45.0s), 10/10 VUs, 893 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  1m45.0s/4m00.0s

running (1m46.0s), 10/10 VUs, 903 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  1m46.0s/4m00.0s

running (1m47.0s), 10/10 VUs, 913 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  1m47.0s/4m00.0s

running (1m48.0s), 10/10 VUs, 923 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  1m48.0s/4m00.0s

running (1m49.0s), 10/10 VUs, 933 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  1m49.0s/4m00.0s

running (1m50.0s), 10/10 VUs, 943 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  1m50.0s/4m00.0s

running (1m51.0s), 10/10 VUs, 953 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  1m51.0s/4m00.0s

running (1m52.0s), 10/10 VUs, 963 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  1m52.0s/4m00.0s

running (1m53.0s), 10/10 VUs, 973 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  1m53.0s/4m00.0s

running (1m54.0s), 10/10 VUs, 983 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  1m54.0s/4m00.0s

running (1m55.0s), 10/10 VUs, 992 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  1m55.0s/4m00.0s

running (1m56.0s), 10/10 VUs, 1002 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  1m56.0s/4m00.0s

running (1m57.0s), 10/10 VUs, 1012 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  1m57.0s/4m00.0s

running (1m58.0s), 10/10 VUs, 1022 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  1m58.0s/4m00.0s

running (1m59.0s), 10/10 VUs, 1032 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  1m59.0s/4m00.0s

running (2m00.0s), 10/10 VUs, 1042 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m00.0s/4m00.0s

running (2m01.0s), 10/10 VUs, 1052 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m01.0s/4m00.0s

running (2m02.0s), 10/10 VUs, 1062 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m02.0s/4m00.0s

running (2m03.0s), 10/10 VUs, 1072 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m03.0s/4m00.0s

running (2m04.0s), 10/10 VUs, 1082 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m04.0s/4m00.0s

running (2m05.0s), 10/10 VUs, 1092 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m05.0s/4m00.0s

running (2m06.0s), 10/10 VUs, 1102 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m06.0s/4m00.0s

running (2m07.0s), 10/10 VUs, 1111 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m07.0s/4m00.0s

running (2m08.0s), 10/10 VUs, 1121 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m08.0s/4m00.0s

running (2m09.0s), 10/10 VUs, 1131 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m09.0s/4m00.0s

running (2m10.0s), 10/10 VUs, 1141 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m10.0s/4m00.0s

running (2m11.0s), 10/10 VUs, 1151 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m11.0s/4m00.0s

running (2m12.0s), 10/10 VUs, 1161 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m12.0s/4m00.0s

running (2m13.0s), 10/10 VUs, 1171 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m13.0s/4m00.0s

running (2m14.0s), 10/10 VUs, 1181 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m14.0s/4m00.0s

running (2m15.0s), 10/10 VUs, 1191 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m15.0s/4m00.0s

running (2m16.0s), 10/10 VUs, 1201 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m16.0s/4m00.0s

running (2m17.0s), 10/10 VUs, 1211 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m17.0s/4m00.0s

running (2m18.0s), 10/10 VUs, 1221 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m18.0s/4m00.0s

running (2m19.0s), 10/10 VUs, 1230 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m19.0s/4m00.0s

running (2m20.0s), 10/10 VUs, 1240 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m20.0s/4m00.0s

running (2m21.0s), 10/10 VUs, 1250 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m21.0s/4m00.0s

running (2m22.0s), 10/10 VUs, 1260 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m22.0s/4m00.0s

running (2m23.0s), 10/10 VUs, 1270 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m23.0s/4m00.0s

running (2m24.0s), 10/10 VUs, 1280 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m24.0s/4m00.0s

running (2m25.0s), 10/10 VUs, 1290 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m25.0s/4m00.0s

running (2m26.0s), 10/10 VUs, 1300 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  2m26.0s/4m00.0s

running (2m27.0s), 10/10 VUs, 1310 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  2m27.0s/4m00.0s

running (2m28.0s), 10/10 VUs, 1320 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  2m28.0s/4m00.0s

running (2m29.0s), 10/10 VUs, 1330 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  2m29.0s/4m00.0s

running (2m30.0s), 10/10 VUs, 1340 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  2m30.0s/4m00.0s

running (2m31.0s), 10/10 VUs, 1350 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  2m31.0s/4m00.0s

running (2m32.0s), 10/10 VUs, 1360 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  2m32.0s/4m00.0s

running (2m33.0s), 10/10 VUs, 1370 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  2m33.0s/4m00.0s

running (2m34.0s), 10/10 VUs, 1380 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  2m34.0s/4m00.0s

running (2m35.0s), 10/10 VUs, 1390 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  2m35.0s/4m00.0s

running (2m36.0s), 10/10 VUs, 1400 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  2m36.0s/4m00.0s

running (2m37.0s), 10/10 VUs, 1410 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  2m37.0s/4m00.0s

running (2m38.0s), 10/10 VUs, 1420 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  2m38.0s/4m00.0s

running (2m39.0s), 10/10 VUs, 1430 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  2m39.0s/4m00.0s

running (2m40.0s), 10/10 VUs, 1440 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  2m40.0s/4m00.0s

running (2m41.0s), 10/10 VUs, 1450 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  2m41.0s/4m00.0s

running (2m42.0s), 10/10 VUs, 1460 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  2m42.0s/4m00.0s

running (2m43.0s), 10/10 VUs, 1470 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  2m43.0s/4m00.0s

running (2m44.0s), 10/10 VUs, 1480 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  2m44.0s/4m00.0s

running (2m45.0s), 10/10 VUs, 1490 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  2m45.0s/4m00.0s

running (2m46.0s), 10/10 VUs, 1500 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  2m46.0s/4m00.0s

running (2m47.0s), 10/10 VUs, 1510 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  2m47.0s/4m00.0s

running (2m48.0s), 10/10 VUs, 1520 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  2m48.0s/4m00.0s

running (2m49.0s), 10/10 VUs, 1530 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  2m49.0s/4m00.0s

running (2m50.0s), 10/10 VUs, 1540 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  2m50.0s/4m00.0s

running (2m51.0s), 10/10 VUs, 1550 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  2m51.0s/4m00.0s

running (2m52.0s), 10/10 VUs, 1560 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  2m52.0s/4m00.0s

running (2m53.0s), 10/10 VUs, 1570 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  2m53.0s/4m00.0s

running (2m54.0s), 10/10 VUs, 1580 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  2m54.0s/4m00.0s

running (2m55.0s), 10/10 VUs, 1590 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  2m55.0s/4m00.0s

running (2m56.0s), 10/10 VUs, 1600 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  2m56.0s/4m00.0s

running (2m57.0s), 10/10 VUs, 1610 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  2m57.0s/4m00.0s

running (2m58.0s), 10/10 VUs, 1620 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  2m58.0s/4m00.0s

running (2m59.0s), 10/10 VUs, 1630 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  2m59.0s/4m00.0s

running (3m00.0s), 10/10 VUs, 1640 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m00.0s/4m00.0s

running (3m01.0s), 10/10 VUs, 1650 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m01.0s/4m00.0s

running (3m02.0s), 10/10 VUs, 1660 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m02.0s/4m00.0s

running (3m03.0s), 10/10 VUs, 1670 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m03.0s/4m00.0s

running (3m04.0s), 10/10 VUs, 1680 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m04.0s/4m00.0s

running (3m05.0s), 10/10 VUs, 1690 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m05.0s/4m00.0s

running (3m06.0s), 10/10 VUs, 1700 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m06.0s/4m00.0s

running (3m07.0s), 10/10 VUs, 1710 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m07.0s/4m00.0s

running (3m08.0s), 10/10 VUs, 1720 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m08.0s/4m00.0s

running (3m09.0s), 10/10 VUs, 1730 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m09.0s/4m00.0s

running (3m10.0s), 10/10 VUs, 1740 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m10.0s/4m00.0s

running (3m11.0s), 10/10 VUs, 1750 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m11.0s/4m00.0s

running (3m12.0s), 10/10 VUs, 1760 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m12.0s/4m00.0s

running (3m13.0s), 10/10 VUs, 1770 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m13.0s/4m00.0s

running (3m14.0s), 10/10 VUs, 1780 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  3m14.0s/4m00.0s

running (3m15.0s), 10/10 VUs, 1790 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  3m15.0s/4m00.0s

running (3m16.0s), 10/10 VUs, 1800 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  3m16.0s/4m00.0s

running (3m17.0s), 10/10 VUs, 1810 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  3m17.0s/4m00.0s

running (3m18.0s), 10/10 VUs, 1820 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  3m18.0s/4m00.0s

running (3m19.0s), 10/10 VUs, 1830 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  3m19.0s/4m00.0s

running (3m20.0s), 10/10 VUs, 1840 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  3m20.0s/4m00.0s

running (3m21.0s), 10/10 VUs, 1850 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  3m21.0s/4m00.0s

running (3m22.0s), 10/10 VUs, 1860 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  3m22.0s/4m00.0s

running (3m23.0s), 10/10 VUs, 1870 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  3m23.0s/4m00.0s

running (3m24.0s), 10/10 VUs, 1880 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  3m24.0s/4m00.0s

running (3m25.0s), 10/10 VUs, 1890 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  3m25.0s/4m00.0s

running (3m26.0s), 10/10 VUs, 1900 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  3m26.0s/4m00.0s

running (3m27.0s), 10/10 VUs, 1910 complete and 0 interrupted iterations
default   [  86% ] 10/10 VUs  3m27.0s/4m00.0s

running (3m28.0s), 10/10 VUs, 1920 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  3m28.0s/4m00.0s

running (3m29.0s), 10/10 VUs, 1930 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  3m29.0s/4m00.0s

running (3m30.0s), 10/10 VUs, 1940 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  3m30.0s/4m00.0s

running (3m31.0s), 10/10 VUs, 1950 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  3m31.0s/4m00.0s

running (3m32.0s), 10/10 VUs, 1960 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  3m32.0s/4m00.0s

running (3m33.0s), 10/10 VUs, 1970 complete and 0 interrupted iterations
default   [  89% ] 10/10 VUs  3m33.0s/4m00.0s

running (3m34.0s), 09/10 VUs, 1980 complete and 0 interrupted iterations
default   [  89% ] 09/10 VUs  3m34.0s/4m00.0s

running (3m35.0s), 09/10 VUs, 1989 complete and 0 interrupted iterations
default   [  90% ] 09/10 VUs  3m35.0s/4m00.0s

running (3m36.0s), 09/10 VUs, 1998 complete and 0 interrupted iterations
default   [  90% ] 09/10 VUs  3m36.0s/4m00.0s

running (3m37.0s), 08/10 VUs, 2007 complete and 0 interrupted iterations
default   [  90% ] 08/10 VUs  3m37.0s/4m00.0s

running (3m38.0s), 08/10 VUs, 2015 complete and 0 interrupted iterations
default   [  91% ] 08/10 VUs  3m38.0s/4m00.0s

running (3m39.0s), 08/10 VUs, 2023 complete and 0 interrupted iterations
default   [  91% ] 08/10 VUs  3m39.0s/4m00.0s

running (3m40.0s), 07/10 VUs, 2031 complete and 0 interrupted iterations
default   [  92% ] 07/10 VUs  3m40.0s/4m00.0s

running (3m41.0s), 07/10 VUs, 2038 complete and 0 interrupted iterations
default   [  92% ] 07/10 VUs  3m41.0s/4m00.0s

running (3m42.0s), 07/10 VUs, 2045 complete and 0 interrupted iterations
default   [  92% ] 07/10 VUs  3m42.0s/4m00.0s

running (3m43.0s), 06/10 VUs, 2052 complete and 0 interrupted iterations
default   [  93% ] 06/10 VUs  3m43.0s/4m00.0s

running (3m44.0s), 06/10 VUs, 2058 complete and 0 interrupted iterations
default   [  93% ] 06/10 VUs  3m44.0s/4m00.0s

running (3m45.0s), 06/10 VUs, 2064 complete and 0 interrupted iterations
default   [  94% ] 06/10 VUs  3m45.0s/4m00.0s

running (3m46.0s), 05/10 VUs, 2070 complete and 0 interrupted iterations
default   [  94% ] 05/10 VUs  3m46.0s/4m00.0s

running (3m47.0s), 05/10 VUs, 2075 complete and 0 interrupted iterations
default   [  95% ] 05/10 VUs  3m47.0s/4m00.0s

running (3m48.0s), 05/10 VUs, 2080 complete and 0 interrupted iterations
default   [  95% ] 05/10 VUs  3m48.0s/4m00.0s

running (3m49.0s), 04/10 VUs, 2085 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  3m49.0s/4m00.0s

running (3m50.0s), 04/10 VUs, 2089 complete and 0 interrupted iterations
default   [  96% ] 04/10 VUs  3m50.0s/4m00.0s

running (3m51.0s), 04/10 VUs, 2093 complete and 0 interrupted iterations
default   [  96% ] 04/10 VUs  3m51.0s/4m00.0s

running (3m52.0s), 03/10 VUs, 2097 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  3m52.0s/4m00.0s

running (3m53.0s), 03/10 VUs, 2100 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  3m53.0s/4m00.0s

running (3m54.0s), 03/10 VUs, 2103 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  3m54.0s/4m00.0s

running (3m55.0s), 02/10 VUs, 2105 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  3m55.0s/4m00.0s

running (3m56.0s), 02/10 VUs, 2107 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  3m56.0s/4m00.0s

running (3m57.0s), 02/10 VUs, 2109 complete and 0 interrupted iterations
default   [  99% ] 02/10 VUs  3m57.0s/4m00.0s

running (3m58.0s), 01/10 VUs, 2111 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  3m58.0s/4m00.0s

running (3m59.0s), 01/10 VUs, 2112 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  3m59.0s/4m00.0s

running (4m00.0s), 01/10 VUs, 2113 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  4m00.0s/4m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=2.99ms
    ✓ 'p(99)<800' p(99)=3.44ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2114    8.781838/s
    checks_succeeded...: 100.00% 2114 out of 2114
    checks_failed......: 0.00%   0 out of 2114

    ✓ ステータスが201である

    HTTP
    http_req_duration..............: avg=2.33ms min=506.6µs med=2.35ms max=24.08ms p(90)=2.84ms p(95)=2.99ms
      { expected_response:true }...: avg=2.33ms min=506.6µs med=2.35ms max=24.08ms p(90)=2.84ms p(95)=2.99ms
    http_req_failed................: 0.00%  0 out of 2114
    http_reqs......................: 2114   8.781838/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s      med=1s     max=1.03s   p(90)=1s     p(95)=1s    
    iterations.....................: 2114   8.781838/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 451 kB 1.9 kB/s
    data_sent......................: 387 kB 1.6 kB/s



running (4m00.7s), 00/10 VUs, 2114 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  4m0s